/**************************************************************
** 	火牛开发板
**	ASCII码字库及汉字自定义字库的应用
**  版本：V1.0
**	论坛：bbs.openmcu.com
**	旺宝：www.openmcu.com
**  邮箱：support@openmcu.com
***************************************************************/
#include "hz16.h"

/*****************************************************************************
** 函数名称: findHzIndex
** 功能描述: 查找汉字在自定义字库中的索引
				hz 指向汉字(机内码)的指针
** 作  　者: Dream
** 日　  期: 2010年12月06日
*****************************************************************************/
uint16_t findHzIndex(uint8_t *hz)                     /* 在自定义汉字库在查找所要显示 */
/* 的汉字的位置 */
{
    uint16_t i = 0;
    FNT_GB16 *ptGb16 = (FNT_GB16 *)GBHZ_16;
    while(ptGb16[i].Index[0] > 0x80)
    {
        if((*hz == ptGb16[i].Index[0]) && (*(hz + 1) == ptGb16[i].Index[1]))
        {
            return i;
        }
        i++;
        if(i > (sizeof((FNT_GB16 *)GBHZ_16) / sizeof(FNT_GB16) - 1))  /* 搜索下标约束 */
        {
            break;
        }
    }
    return 0;
}

/*********************************************************************************************************
** End of File
*********************************************************************************************************/
